{"1-1": "The first level takes place in a rough room where only a few objects are available, including TV, Boxes, Outer, and pipelines. You don’t need to worry, as the game has designed the first level for teaching. The game in itself will highlight items you have to gather, and also teach you how to merge found objects and solve puzzles, and use a hint system when in any difficulty.\n - Firstly you have to collect the first part of a screwdriver from an outer\n - Screwdriver’s second is kept next to the TV\n - Thirdly connect both parts to complete the screwdriver, and open the screws of 1P to grab a remote and cable\n - Connect the cable with the TV and turn it on using the remote\n - Upon getting on, the TV will display you a pattern that you have to draw somewhere to open the door\n - Your last objective in the first room is to find the locker to draw the pattern and open the door. The lock is hidden behind the pipelines\n - But before, you must use the screwdriver to open the 2P and rotate the switches to draw the same pattern",
"1-2": "After leaving the rough room, you find yourself standing in a lush and well-decorated room. There are a cupboard and a pot available nearby the main door, and your goal is to find objects and solve a puzzle to escape. Displaying no name of any items you intend to find makes the game more challenging to play.\n - Collect a key from the plant pot and head to the cupboard to open its drawer to collect a paper\n - See what’s written on the paper, and type the same letters on the laptop available at your left-hand side on a table nearby the office chair\n - In the next scene, you will see the number 1886 on the laptop screen\n - Visit the cupboard once again, open its first door where you find a locker having a dial. Enter the number you got on the laptop’s screen to open it for the key card of the door",
"1-3": "The third level takes you to another room where you find beautiful furniture, painting, and a laptop. The primary task is the same as the previous stages – escape the room to visit the next stages.\n - Firstly of all pick up the yellow-colored pillow from the sofa to grab a key\n - Use the key to open the drawer for a DVD\n - Explore the first painting hanging on the wall of your left-hand-side to reveal the numbers like 7394\n - Insert the DVD to the laptop and enter the password you discovered from the painting to open\n - Next to that, the game displays you a pattern on the screen that you must follow and draw on the locker to open for the primary key\n - Grab the key to open the door and escape",
"1-4": "Welcome to the kitchen, where you’re not supposed to cook a yummy meal upon getting hungry. Interact with kitchen stuff to solve a challenging puzzle that won’t be completed until you find the required items. Therefore, we jump in to help those guys who don’t know how to figure things out.\n - Click on the shelf to collect a plate full of vegetable\n - Pick up a bread from the frying pan kept over the stove and bring out a chicken from the Oven kept in the cupboard fixed above the stove\n - Hit the third drawer to open it, and collect a sauce bottle\n - Now, click on the first table where you discover a red-colored dish having a bread piece\n- Put the chicken into the bread, add some vegetables, sauce, and a second piece of the bread to make your burger completed\n - Click on a machine fixed in the right-hand wall, put the burger into the machine, and collect a key from there to open the door\n - Use the key to open the door and escape",
"1-5": "A fully furnished room awaits you with a challenging puzzle to solve. In the previous level, we have prepared a delicious burger to obtain a key, let’s see what the next level has to reveal.\n - Collect a remote from the drawer available at your left-hand side and for batteries, head to the front cupboard\n - Put the batteries into the remote and turn on the TV to reveal a code which is 1096\n - Tap on the beautiful scenery available above the bed to reveal a security dial\n - Enter the code you got from TV to collect a key\n - Use the key to open the bed-connected drawer to obtain a keycard and open the door to escape",
"1-6": "The game unlocks another room to solve a tricky puzzle. This time, it seems you are in an old house that hasn’t been opened for many years. Following the steps mentioned in Escape Game: 50 Rooms 1 Walkthrough to keep unlocking other rooms.\n - Pick up the pillow to grab and add the head of the hammer to your inventory\n - The handle is kept below the pillow available on the bed, and your next goal is to prepare a hammer by connecting both pieces\n - Use the hammer to break the locker and find security keys to open it\n - Investigate the painting containing three gems and the cupboard next to the bed having colorful blocks, as well as the image above the cupboard to reveal the code 535\n - Use the key to open the door and escape",
"1-7": "The next scene makes you feel like you’re in pyramids where secret rooms hold a lot of golden statues and something writing in traditional language.\n - Click on the shelf available right before the first statue holding a box to get a screwdriver\n - Tap on the wall of your right-hand-side to open the box and collect a duck and a hammer\n - Before the first box, there’s another with a statue that holds a duck paw\n - There’s a pot kept before the golden statue of your right-hand-side that you need to break using the hammer and collect pieces\n - Now, collect the first statue available on a wall of your left-hand-side, where you discover a locker requiring a four-digit code. Click on a paper piece you gathered after breaking the pot, written numbers in Arabic letters, 1523\n - Add the number and collect a statue of a bird\n - Tap on the main door, add all statues/objects you have gathered by solving puzzles to the door and escape",
"1-8": "After completing the 7th level, the game once again takes you to a modern room, and it seems like the room you have visited before for the completion of the puzzle, but the stuff and arrangement are different.\n - A Block-colored is holding a piece of the puzzle, while the second is above the massive cupboard available at your left-hand-side.\n - The third piece of the puzzle is available in the breakfast dish kept on the bed, while a mini-game is planned for you to complete right above the cupboard fixed nearby the front wall\n - Complete the mini-game to reveal a pattern, and head to a book available on the sofa with a locker\n - Draw the same pattern to open it for rings and add these rings to the wall clock\n - Set the time; you saw above the cupboard when you were collecting the 2nd piece of the puzzle earlier this level 6:15\n - Use the key to open the door and escape",
"1-9": "Escape Game: 50 Rooms 1 welcomes you to a new room where you find different objects to interact with for the completion of objectives. The most challenging part of the game is that it doesn’t feature any system that informs you what to find, even the game doesn’t intend to show you names of those objects you have to see to solve puzzles. Therefore, you should use your wit to find out hidden objects, and reach the end to get a key and open the door.\n - At the level 10th, you need to click on the plant pot to grab a key and open the drawer of the cupboard available at your left-hand-side\n - Open the drawer and pick up a rope from there\n - Tap on the table to collect a paper\n - Now, head to the sofa, remove the couch and collect a stick\n - There’s a scissor under the table and awaits you to be collected\n - Use the scissor to cut the piece of rope and connect it with the stick to make a fishing tool\n - Now, bring the tool near the aquarium to pick up a piece of puzzle game\n - Reveal the paper you have collected from the table to see what has written on it\n - Apply the piece of the puzzle you found from the fish pot to reveal the password you need to open a locker\n - Enter the password 6831 to open the locker and collect a dish kept nearby it\n - Interest the disk to the laptop to see the pattern you need to open another locker, but before you have to play a mini-game\n - Set the color of the locker following the laptop screen and open the safe to get a keycard to open the door",
"1-10": "The game takes you to a pretty cool and beautiful room where only a few items are available over there to find and unlock the door.\n - Click on the bed, remove the pillow to collect a ring; meanwhile, remember the digit 2\n - Select the ring from the inventory, visit the table where you find a box, fix the ring, and open the cap to discover the 2nd digit which is 3\n - Collect the paper from the lower section of the same table, and note the digit 5\n - Hit the clock to discover the colored digit which is 8\n - Choose the paper from the inventory and clean the mirror available at your left-hand-side. Next to that, the mirror displays you four images\n - Click on the front wall, discover the scenery and draw images you have found in the mirror\n - Once done, the game opens a locker asking you to enter the digits\n - Enter the code 2385 to open the locker and collect a stick from there\n - Use the stick to open the box available under the bed and obtain a piece of the puzzle\n - Play a mini-game to complete a challenging puzzle\n - You will receive a key as you complete the image by adding a missing piece",
"1-11": "A room with blue-colored walls and lots of briefcases are ready to welcome you with a new puzzle to complete. Step into the room to solve a mystery, because you have to escape at any cost, but it can’t be done without completing challenging tasks. Therefore, follow the instructions mentioned in Escape Games 50 Rooms 1 Walkthrough to deal with all challenging tasks.\n - Click on the guitar to make it aside and collect the handles of the plier\n - Tap on the 2nd floor of the bed to grab a plier and add it to your inventory\n - Connect both parts of the plier you collected to prepare it\n - There’s a small paper hidden behind the board fixed on the wall of your left-hand side; your goal is to collect it\n - Use the plier to open the briefcase available on the floor and remember the color of the cubes\n - The game features a board above the bed having different colors, and it requires you to adjust the colors according to the cubes\n - Open the locker to collect perfume and keep the pillow aside to collect the 2nd piece of the paper\n - Spray the perfume to the paper you collected to reveal the code 0745\n - Set the number on an alarm clock and get a key to open the door",
"1-12": "Have you ever seen any bike within a room? If yes, the moment has come when you discover a bicycle in the room. The game introduces a lush room having beautiful furniture and many other rare items. Complete the puzzle to unlock other rooms to escape the mansion.\n - Visit the bed where you discover a white-colored teddy bear\n - Pick up the teddy bear to collect keys\n - Lift the pillow to gather a battery from there, and the 2nd battery is available between the cupboard and the dustbin\n - Open the first drawer to collect a cassette\n - Tap on the wood-colored cupboard, open the drawer to reveal a recorder, insert batteries, and hit the on the button to display the code which is 8659\n - The cupboard has a locker requiring a four-digit password to get opened. Enter the code 8659 to open it for a screwdriver\n - Open the left part of the cupboard and make use of a screwdriver to unlock the box that tasks you with finding the colors of the said objects\n - Collect a marker available near the 2nd tire of the bicycle\n - Use the marker to draw something on a whitepaper to reveal the color of the flower\n - Adjust the color of drawings in the locker to get keys to the door",
"1-13": "Get ready to explore the TV Lounge, where dozens of items are available, along with beautiful sceneries. Similar to other rooms, keys will be in your hands upon completing the puzzles. Therefore, you should find hidden objects in the form of clues, analyze them to confirm where to use them, and reach the end to escape.\n - Start finding objects by watching a wire cutter under the table\n - Open the drawer of the cupboard fixed in the front wall nearby the door to collect a bottle opener\n - Use the cutter from your inventory to break the locker of the box and collect a paper\n - Click on the painting hanging on the front wall to make it aside and grab a key from the secret spot\n - Use the key to open the door to another room, head to the bottle, and use the opener to remove the cap to collect another paper\n - Find and add both values written on the papers, and use the final answer to open locker 5787 to grab a keycard",
"1-14": "It seems there’s something mysterious happened in room no 14. Therefore, you aren’t allowed to spend a lot of time over there. Find a solution as soon as possible and escape after finding a key to the door.\n - The first key of any locker or drawer you will discover under the cushion\n - Pick up a paper from an ashtray and use the key to open the drawer of the cupboard where you find a marker\n - Hit the book section to obtain a memory card\n - There’s a diary nearby the laptop; keep the diary aside and use the marker to reveal the letters\n - Collect a USB from the drawer of the same table, insert the card to the USB and connect it with the laptop\n - Open the paper you had collected from the ashtray and enter the code following the pattern drawn on it 1961\n - Next to that, the game displays you a mini-game to play wherein you have to find differences between two same images\n - Once done, the game shows you a code 313 that you have to type in the locker available in the same table\n - Collect the key from the first drawer and open the door to escape",
"1-15": "As level 15 starts, you find yourself standing within a room made up of wood. Following the footsteps of previous rooms, you can expect the same kind of puzzle to solve. In the game, you have limited hints; therefore, you should think twice before using one.\n - At your left-hand side, there’s a global map available, and you need to remove it to discover drawing of objects\n - Click on the first cupboard at your right-hand side, and open the locker drawing the same objects you discovered under the map\n - After opening the drawer, you will discover a metallic ball\n - Put the ball on the weight machine to reveal how much weight it has and note the weight and the letter X written nearby the machine\n - Keep all the books aside to reveal the formula written on a small paper\n - The scenery on the front wall is protected with a wooden frame; collect the frame and add it to your inventory to use later\n - Put the wooden frame to another scenery of the sun and reveal how many white-colored dots the sun has\n - The game has featured a mini-game on the floor for you to follow the pattern of dots that appeared on the scenery of the sun\n - After drawing the pattern, the game will reveal a secret spot holding a ruler for you to grab\n - Click on the blackboard, but the ruler over there, and try to find the value of x and y\n - Tap on the drawer after finding values and enter the values of x, y, and z to get a key to the door",
"1-16": "For sure, you have noticed the difficulty level that is gradually increasing and bringing challenging puzzles to solve. Newbies will indeed find themselves in trouble after reaching the high levels. In contrast, those who master finding hidden objects may feel difficulty finding objects because the game isn’t displaying the names of the items you need to see to open the door. Therefore, we jump in to help you guys by offering the perfect Walkthrough of Escape Game: 50 Rooms 1 Guide.\n - Click on the table to collect pins and a bolt\n - Tap on a world map like object available nearby the front wall to collect a drawer handle and a coin\n - Visit the left-hand side wall to open the drawer and find an object like a screwdriver\n - Use the pins to open the door of the bathroom and place the missing drawer handle, put the bolt, and use the screwdriver to tight it\n - Put the cap on the lock and open the drawer to collect a towel and a spray bottle\n - Clean the mirror to reveal the code 7649\n - Tap on the cupboard of brown in color where a locker is available, enter the code you got from the mirror and get a keycard",
"1-17": "Upcoming level occurs in a relatively simple environment where the oven, water dispenser, computer, and many other items are available.\n - Click on the furniture available on your left-hand side and collect a button from above the table\n - Pick up the jug and back to the main scene\n - Open a small refrigerator, get a place from there, add the button to the microwave oven, open the door, and keep the place into the oven you picked from the fridge\n - Set the timer to melt the cheese and collect a key\n - Use the key to open the drawer of the cupboard where you have collected a jug\n - The drawer holds a tap for you to collect\n - Tap on the water dispenser, fix the tap, place the jug below the tap, and turn it on to have some water in the jug\n - Visit the table once again, but the water in the thermos to collect a paper\n - The paper reveals the shapes of fruit and masks. Find out how many fruits, masks, and flowers are available across the room\n - The fridge has a locker, and you must enter a 3-digit code (574) to open the safe\n - Collect the key from the safe and open the door to visit the next room",
"1-18": "Are you feeling hungry? The game takes you to a dining table where not even a single dish is available to eat. Switch your mind to solve a tricky puzzle. The difficulty level is gradually increasing and offering you the most challenging puzzles to solve. Imagine what would be the puzzle on the last level.\n - Explore the cupboard where you find a bowl having a key\n - Use the key and open the drawer below the bowl to get a knife\n - Select the knife from your inventory and cut a leaf having white powder\n - Take the leaf on the dining table, and put it on the candle for a while to reveal the code you need to open the locker\n - Draw the pattern to open the locker and collect a tablet and use the knife to cut a piece of bread available on the table\n - Play a mini-game on the tablet with the task of arranging the pieces correctly to complete the image watching the scenery\n - As the game ends, it displays you three objects such as Candle, Pillow, and a Chair\n - Count the candles, pillows, and chairs, and head to a locker fixed outside the parrot cage requiring you to enter three-digit code 835\n - Give the bread to the parrot after opening the cage, and get a key from there to open the door",
"1-19": "After completing eighteen rooms, you find yourself between ancient items like masks, rare paintings, furniture, and an armor suit. The game features a piano and many other instruments to keep you engaged for endless hours of fun. Explore the environment to discover objects, analyze them to find clues, and get out of the room to head to the next scenes.\n - Click on the piano to collect a piece of the puzzle from the right side of the painting and a key\n - Tap on the masks available on the front wall to gather the 2nd piece of the puzzle\n - Click on the statue of an animal coming out of the wall of your right-hand side, and collect the third piece of the puzzle over there\n - Use the key to open the drawer of the table kept near the right wall where you obtain a cutter\n - Below the drawer, there’s a cupboard holding the last piece of the puzzle\n - Click on the paper to reveal the code 2509\n - Enter the code to open the box that reveals a tablet asking you to draw a pattern to make it unlocked\n - Figure out the painting hanging on the wall to learn the arrangement of colors\n - Draw the same color on the tablet to reveal that the armor suit has a key to the door",
"1-20": "It seems you’re in any laboratory where experiments on robotic technology have been conducted. Your goal is to interact with those robots to find clues and reach the key to grab them.\n - Tap on a silver-colored doll to collect a DVD, don’t forget to remember the number written on the head\n - There’s a screen near the left wall, where you must tap on it to add the DVD and start playing a game asking you to set the robots’ faces according to the real standing ahead of you earlier this level.\n - Once done, start playing another game of the same type\n - Tap on the massive robot to reveal a system asking you to draw a pattern to unlock the safe and grab a rod\n - Use the rod to open the primary system of the door where the game requests you to enter three-digit code 957",
"1-21": "Similar to other rooms, there are many items, furniture, and objects available to find. Reveal your detective skills to find everything objects within no time; otherwise, you will keep finding things, and the day will pass.\n - Click on the bed to find a SIM card below the pillow\n - Under the bed, there is a handle of a screwdriver\n - Click on the table to collect a cellular phone\n - Insert the SIM card into the mobile phone and turn it on to receive updates: Calls 2, Messages 5, and Updates 8\n - Click on the locker available above the PC and add the code you revealed on the phone 258 and collect a key\n - Use the key to open the first drawer of the cupboard available at your left-hand side and collect the 2nd part of a screwdriver\n - Complete the screwdriver, and start your search for a moon and a star available on opposing shelves\n - Open the frame to bring the stick out and add it to your inventory\n - Use the stick to bring another star out from a deep hole available in the wall\n - Tap on the scenery and collect a ranch\n - Visit the last drawer of the cupboard, use the ranch to open the bolt, and collect a box from there\n - Add the objects you found to open the box and have a key to the main door",
"1-22": "The game welcomes you to a colorful world. Many cute objects hang out to make you entertained, and many other items are hidden secretly.\n - Collect a ring from a black-colored stick\n - Explore the stairs to find out secret numbers available on fishes\n - At your left-hand side, there’s a locker containing a triangle-shaped object, and the code is 247\n - Tap on the wing of the whale to let the game display you an image of different fishes containing different numbers\n - Tap on wooden drums and set the color in the proper order to claim another geometry shape\n - Click on a board having empty spaces for shapes you collected from different locations. Add the shapes in their respective places, including the ring, to reveal the next code, which is 479\n - Use the code to open the main door, but you have to play a mini-game before escaping.",
"1-23": "It seems you’re in a kitchen full of objects and challenging items. Different furniture and stuff are there to interact with, and you must tap on the screen randomly to discover clues and solve puzzles.\n - Collect a matchbox by removing cushions from a sofa\n - Visit the cupboard below the stove, open the drawer and pick up an air pressure pump\n - Tap on the floor, use the pump to fill the air in the football, and remember the order of colors displaying you via stars\n - Once again, visit the cupboard below the stove, open the locker and adjust the color according to the stars seen on the football\n - Open the drawer to collect a magnet\n - There’s a stick under the sofa, and you must connect the magnet with that stick to bring a button out of a drum\n - Place the button in the drawer of the stove and pick up a cup from there\n - Collect a box of coffee from the shelf available above the stove and add to your inventory\n - Put the coffee in the pot using the box and make fire using the matchbox\n - Fill the cup with coffee and collect a paper from the table\n - Put the coffee in another cup on the table, use the tissue to clean the cup for the code you need 7164\n - The game places a locker nearby the stove table, and it asks you to put the code got from inside the cup to open it\n - As the box opens, the game lets you head to a mini-game, in which you have to match two similar fruits to progress\n - After that, the game gives you a key to the door to escape",
"1-24": "Escape Game 50 Rooms takes you to a lush room full of beautiful decoration pieces and furniture. The room is lighting up with dim light and the combination of colors and furniture is mind-blowing. Start finding objects following the Guide Escape Game 50 Rooms 1 Walkthrough.\n - Tap on the table to collect a knife from below it.\n - Select the knife from your inventory and give a cut to the sofa as mentioned in the image of Escape Game 50 Rooms Walkthrough level 24, and collect a rod.\n - Open the cupboard available near the front wall and collect another rod.\n - Select the first rod, visit the door available on the left side of the room to bring out a key from below the door. Now, you have to use the key to open the door.\n - Select the 2nd rod and remove the cover of the commode seat and collect a handle.\n - Choose the handle from your inventory and fix it on the drawer where you discover a digital locker.\n - Enter the code (7463) to open the drawer and collect a card key to escape the room.",
"1-25": "Have you ever dream to discover ancient items like knight suits, swords, paintings, and more? If yes, then get ready because the game will introduce you to a room having lots of ancient stuff. Start collecting objects to open the door and escape.\n - Tap on the small wardrobe near the skeleton and open the last drawer to collect a scissor.\n - Explore the drums available between a sofa and knight suits to pick up a blue-colored cube.\n - Use the scissor to cut the cube and grab a key to any door.\n - Visit the wardrobe once again and open its first drawer to collect a bottle.\n - A piece of paper is available below the cushion on the sofa.\n - Select the paint bottle and head to the painting where you must drop the color on the painting and clean using the paper you collected from the sofa. Soon, the painting will reveal a pattern of arrows you have to follow to open the lock.\n - Head the wardrobe once again and enter the code (5273) and collect a hammerhead.\n - See behind the painting to find a handle.\n - Connect the handle and head to prepare a hammer, and slide the painting to reveal a secret place behind it.\n - Use the hammer to break the cover and reveal the clues to solve the puzzle. To solve the puzzle, you have to tap on the third circle in the first column, the first circle in the 2nd column, the 4th circle in the third column, and 2nd circle in the 4th column. Once done, the locker will open and give you a key to the main door.\n - Use the key to open the door and escape."
}